const articlesData = [
  {
    id: 1,
    title: "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة",
    description:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
    image: "./assets/article.svg",
    date: "08/28/1446",
  },
  {
    id: 2,
    title: "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة",
    description:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
    image: "./assets/article.svg",
    date: "08/28/1446",
  },
  {
    id: 3,
    title: "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة",
    description:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
    image: "./assets/article.svg",
    date: "08/28/1446",
  },
  {
    id: 4,
    title: "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة",
    description:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
    image: "./assets/article.svg",
    date: "08/28/1446",
  },
  {
    id: 5,
    title: "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة",
    description:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
    image: "./assets/article.svg",
    date: "08/28/1446",
  },
  {
    id: 6,
    title: "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار المحلي لشهر مارس 2025م ضمن برنامج صكوك حكومة المملكة",
    description:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
    image: "./assets/article.svg",
    date: "08/28/1446",
  },
];

const articlesContainer = document.getElementById("articlesContainer");
const popup = document.querySelector(".popup");
const popupImg = document.querySelector(".popupImg");
const popupTitle = document.querySelector(".popupTitle");
const popupTime = document.querySelector(".popupTime");
const popupDescription = document.querySelector(".popupDescription");
const popupClose = document.querySelector(".popupClose");

const renderArticles = () => {
  articlesData.forEach((articleData) => {
    const { id, title, image, date } = articleData;

    const article = document.createElement("article");

    article.className = "p-3 articleBorder d-flex flex-column align-items-start gap-24 radius-16";
    article.id = id;

    const articleContent = `
      <div class="imageContainer"><img src="${image}" alt="article image" class="radius-8" /></div>
      <h3 class="fs-18px fw-bold mb-0 articleTitleColor">${title.split("").splice(0, 135).join("")}...</h3>
      <time datetime="${date}" class="px-8px radius-4 fw-medium fs-12px">${date}</time>
      <button class="readMoreBtn px-3 radius-4 border-0 fw-medium fs-6 text-white">قراءة المزيد</button>
    `;

    article.innerHTML = articleContent;

    const btn = article.querySelector(".readMoreBtn");

    btn.addEventListener("click", () => {
      readMoreHandler(articleData);
    });

    articlesContainer.appendChild(article);
  });
};

renderArticles();

function readMoreHandler(article) {
  const { title, description, image, date } = article;
  popup.classList.add("active");
  popupImg.setAttribute("src", image);
  popupTitle.innerHTML = title;
  popupTime.innerHTML = date;
  popupTime.setAttribute("datetime", date);
  popupDescription.innerHTML = description;

  popupClose.addEventListener("click", () => {
    popup.classList.remove("active");
  });
}

popup.addEventListener("click", (e) => {
  if (e.target === popup) {
    popup.classList.remove("active");
  }
});
